000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КонтактныеЛицаСлужбыДоставки/КонтактныеЛицаСлужбыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛицаСлужбыДоставки</name>
  <attributes>
    <name>Флаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КонтрагентыСлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailДополнительный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КонтактныеЛицаСлужбыДоставки/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыКонтактноеЛицо = Новый Структура;
	ПараметрыКонтактноеЛицо.Вставить("КонтактИнд", ТекущийОбъект.Идентификатор);
	ПараметрыКонтактноеЛицо.Вставить("Контрагент", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Контрагент, "Идентификатор"));
	ПараметрыКонтактноеЛицо.Вставить("Фамилия", ТекущийОбъект.Фамилия);
	ПараметрыКонтактноеЛицо.Вставить("Имя", ТекущийОбъект.Имя);
	ПараметрыКонтактноеЛицо.Вставить("Отчество", ТекущийОбъект.Отчество);
	ПараметрыКонтактноеЛицо.Вставить("Телефон", ТекущийОбъект.Телефон);
	ПараметрыКонтактноеЛицо.Вставить("Email", ТекущийОбъект.Email);
	
	СтруктураОтвета = ОбменНПСервер.КонтактноеЛицоКонтрагентаЗаписать(ПараметрыКонтактноеЛицо);
	
	Если СтруктураОтвета.Ошибка Тогда
	
		Отказ = Истина;
		Сообщить(СтруктураОтвета.ТектОшибки);
		
	Иначе
		
		ТекущийОбъект.Идентификатор = СтруктураОтвета.КонтактИнд;
		ТекущийОбъект.КонтактноеЛицо = СтруктураОтвета.КонтактноеЛицо;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
